TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
/* -*- c++ -*-
 *
 * SOCLIB_LGPL_HEADER_BEGIN
 * 
 * This file is part of SoCLib, GNU LGPLv2.1.
 * 
 * SoCLib is free software; you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published
 * by the Free Software Foundation; version 2.1 of the License.
 * 
 * SoCLib is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You should have received a copy of the GNU Lesser General Public
 * License along with SoCLib; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA
 * 02110-1301 USA
 * 
 * SOCLIB_LGPL_HEADER_END
 * 
 * TMS320C6X Instruction Set Simulator for the TMS320C6X processor core
 * developed for the SocLib Projet
 * 
 * Copyright (C) IRISA/INRIA, 2008
 *         Francois Charot <charot@irisa.fr>
 *
 * 
 * Maintainer: charot
 *
 * Functional description:
 * The following files: 
 * 				tms320c62.h
 *              tms320c62.cpp
 *              tms320c62_instructions.cpp
 *              tms320c62_decoding.cpp
 *
 * define the Instruction Set Simulator for the TMS320C62 processor.
 *
 * 
 */

#include "tms320c62.h"

namespace soclib {
namespace common {

void Tms320C6xIss::print_creg(uint32_t inst) {
	char creg, z;

	creg = inst >> 29 & 0x7;
	z = inst >> 28 & 0x1;

	if (creg == 0 && z == 0) {
		std::cout << "          ";
	} else {
		if (z == 1)
			std::cout << "    [!";
		else
			std::cout << "    [ ";
		if (creg == CREG_B0)
			std::cout << "B0] ";
		else if (creg == CREG_B1)
			std::cout << "B1] ";
		else if (creg == CREG_B2)
			std::cout << "B2] ";
		else if (creg == CREG_A1)
			std::cout << "A1] ";
		else if (creg == CREG_A2)
			std::cout << "A2] ";
	}
}

void Tms320C6xIss::iprint(const char *inst, int32_t src1, int32_t src2,
		int32_t dst, const char *unit, uint8_t s, char x, char src1or2) {
	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << ((x==1 && src1or2
			==1) ? ab[!s] : ab[s]) << src1 << ", "
			<< ((x==1 && src1or2==2) ? ab[!s] : ab[s]) << src2 << ", " << ab[s]
			<< dst;
}

void Tms320C6xIss::iprintc1(const char *inst, int32_t src1, int32_t src2,
		int32_t dst, const char *unit, uint8_t s, char x, char src1or2) {
	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << std::hex << src1
			<< std::dec << " " << ((x==1 && src1or2==2) ? ab[!s] : ab[s])
			<< src2 << ", " << ab[s] << dst;
}

void Tms320C6xIss::iprintc2(const char *inst, int32_t src1, int32_t src2,
		int32_t dst, const char *unit, uint8_t s, char x, char src1or2) {
	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << ((x==1 && src1or2
			==1) ? ab[!s] : ab[s]) << src1 << ", " << src2 << ", " << ab[s]
			<< dst;
}

void Tms320C6xIss::iprintld(const char *inst, int32_t src1, int32_t src2,
		int32_t dst, const char *unit, uint8_t s, uint8_t x) {

	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << ab[x] << src2
			<< "[ " << ab[x] << src1 << " ]," << ab[s] << dst;
}

void Tms320C6xIss::iprintldc(const char *inst, int32_t src1, int32_t src2,
		int32_t dst, const char *unit, uint8_t s, uint8_t x) {

	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << ab[x] << src2
			<< "[ " << src1 << " ]," << ab[s] << dst;
}
void Tms320C6xIss::iprintst(const char *inst, int32_t src1, int32_t src2,
		int32_t dst, const char *unit, uint8_t s, uint8_t x) {

	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << ab[s] << dst
			<< ", " << ab[x] << src2 << "[ " << ab[x] << src1 << " ]";
}

void Tms320C6xIss::iprintstc(const char *inst, int32_t src1, int32_t src2,
		int32_t dst, const char *unit, uint8_t s, uint8_t x) {

	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << ab[s] << dst
			<< ", " << ab[x] << src2 << "[ " << src1 << " ]";
}

void Tms320C6xIss::iprint4(const char *inst, int32_t csta, int32_t cstb,
		int32_t src2, int32_t dst, const char *unit, uint8_t s, char x,
		char src1or2) {
	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << csta << ", "
			<< cstb << ", " << ((x==1 && src1or2==2) ? ab[!s] : ab[s]) << ", "
			<< src2 << ab[s] << dst;
}

void Tms320C6xIss::iprint2(const char *inst, int32_t src2, int32_t dst,
		const char *unit, uint8_t s, char x, char src1or2) {
	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << ((x==1 && src1or2
			==2) ? ab[!s] : ab[s]) << ", " << src2 << ab[s] << dst;
}

void Tms320C6xIss::iprint2c(const char *inst, int32_t src2, int32_t dst,
		const char *unit, uint8_t s, char x, char src1or2) {
	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << std::hex << src2
			<< std::dec << ", " << ab[s] << dst;
}

void Tms320C6xIss::iprint1(const char *inst, int32_t dst, const char *unit,
		uint8_t s, char x, char src1or2) {
	char ab[3] = "AB";

	std::cout << inst << " " << "." << unit << s+1 << " " << ab[s] << dst;
}

void Tms320C6xIss::iprint1c(const char *inst, int32_t dst, const char *unit,
		char s, char x, char src1or2) {

	std::cout << inst << " " << "." << unit << s+1 << " " << std::hex << dst
			<< std::dec;
}

void Tms320C6xIss::iprint0(const char *inst) {
	std::cout << inst;
}

void Tms320C6xIss::iprint01(const char *inst, uint32_t num) {
	std::cout << inst << " " << num;
}

void Tms320C6xIss::instruction_print(uint32_t inst) {
	//instruction print
	//decode instructions, source & destination registers
	//and print them out
	//

	char creg, z, op = 0, unit = 0;
	char dst, src1, src2, x, s;
	uint32_t uicst1, uitmp;
	int32_t sicst1;
	int64_t slcst1;
	uint64_t ulcst1;
	char y, mode;

	creg = (inst >> 29) & 0x07;
	z = (inst >> 28) & 0x01;
	dst = (inst >> 23) & 0x1f;
	src2 = (inst >> 18) & 0x1f;
	src1 = (inst >> 13) & 0x1f;
	x = 0;
	s = (inst >> 1) & 0x01;
	if (getUnit_3bit(inst) == LUNIT) {
		// .L unit instruction
		x = (inst >> 12) & 0x01;
		op = (inst >> 5) & 0x7f;
		unit = LUNIT;

	} else if (getUnit_5bit(inst) == MUNIT) {
		// .M unit instruction
		x = (inst >> 12) & 0x01;
		op = (inst >> 7) & 0x1f;
		unit = MUNIT;

	} else if (getUnit_5bit(inst) == DUNIT) {
		// .D unit instruction
		op = (inst >> 7) & 0x3f;
		unit = DUNIT;

	} else if (getUnit_2bit(inst) == DUNIT_LDSTOFFSET) {
		// .D unit load/store
		op = (inst >> 4) & 0x07;
		unit = DUNIT_LDSTOFFSET;

