TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
	} else if (getUnit_2bit(inst) == DUNIT_LDSTBASEROFFSET) {
		// .D unit load/store with baseR/offsetR specified
		op = (inst >> 4) & 0x07;
		unit = DUNIT_LDSTBASEROFFSET;

	} else if (getUnit_4bit(inst) == SUNIT) {
		// .S unit instruction
		x = (inst >> 12) & 0x01;
		op = (inst >> 6) & 0x3f;
		unit = SUNIT;

	} else if (getUnit_5bit(inst) == SUNIT_ADDK) {
		// .S unit ADDK instruction
		op = 0; //nothing specified
		unit = SUNIT_ADDK;

	} else if (getUnit_4bit(inst) == SUNIT_IMMED) {
		// .S unit Field operations (immediate forms)
		op = (inst >> 6) & 0x03;
		unit = SUNIT_IMMED;

	} else if (getUnit_4bit(inst) == SUNIT_MVK) {
		// .S unit MVK
		op = 0; // nothing specified
		unit = SUNIT_MVK;

	} else if (getUnit_5bit(inst) == SUNIT_BCOND) {
		// .S unit Bcond disp
		op = 0; // nothing specified
		unit = SUNIT_BCOND;

	} else if (getUnit_11bit(inst) == NOP) {
		// NOP instruction
		op = 0;
		unit = 0;

	} else if (getUnit_16bit(inst) == IDLEINST) {
		op = IDLEOP;
		unit = IDLEUNIT;
	} else {
		/* unknown instruction kind */
		std::cout
				<< "unknown instruction type encountered in instruction_print function "
				<< std::endl;
	}

	print_creg(inst);

	//find constants
	sicst1 = ((int32_t) src1 << 27) >> 27; /*taking care of sign bit extn*/
	uicst1 = (uint32_t) src1;
	slcst1 = ((int64_t) src1 << 59) >> 59; /*taking care of sign bit extn*/
	ulcst1 = (uint64_t) src1;

	if (op == 0x1a && unit == LUNIT) {
		/*ABS xsint, sint*/
		iprint2("ABS {xsint, sint}", src2, dst, "L", s, x, 2);

	} else if (op == 0x38 && unit == LUNIT) {
		/*ABS slong, slong*/
		iprint2("ABS {slong, slong}", src2, dst, "L", s, x, 0);

	} else if (op == 0x03 && unit == LUNIT) {
		/*ADD sint, xsint, sint*/
		iprint("ADD {sint, xsint, sint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x07 && unit == SUNIT) {
		/*ADD sint, xsint, sint*/
		iprint("ADD {sint, xsint, sint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x23 && unit == LUNIT) {
		/*ADD sint, xsint, slong*/
		iprint("ADD {sint, xsint, slong}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x2b && unit == LUNIT) {
		/*ADDU usint, xusint, uslong*/
		iprint("ADDU {usint, xusint, uslong}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x21 && unit == LUNIT) {
		/*ADD xsint, slong, slong*/
		iprint("ADD {xsint, slong, slong}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x29 && unit == LUNIT) {
		/*ADDU xusint, uslong, uslong*/
		iprint("ADD {xusint, uslong, uslong}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x02 && unit == LUNIT) {
		/*ADD scst5, xsint, sint*/
		iprintc1("ADD {scst5, xsint, sint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x06 && unit == SUNIT) {
		/*ADD scst5, xsint, sint*/
		iprintc1("ADD {scst5, xsint, sint}", sicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x20 && unit == LUNIT) {
		/*ADD scst5, slong, slong*/
		iprintc1("ADD {scst5, slong, slong}", sicst1, src2, dst, "L", s, x, 0);

	} else if (op == 0x10 && unit == DUNIT) {
		/* ADD sint, sint, sint*/
		iprint("ADD {sint, sint, sint}", src1, src2, dst, "D", s, x, 0);

	} else if (op == 0x12 && unit == DUNIT) {
		/* ADD ucst5, sint, sint*/
		iprintc1("ADD {ucst5, sint, sint}", uicst1, src2, dst, "D", s, x, 0);

	} else if (op == 0x30 && unit == DUNIT) {
		/*ADDAB Add Byte with Addressing sint, sint, sint*/
		iprintld("ADDAB {+baseR[offsetR], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x34 && unit == DUNIT) {
		/*ADDAH Add Byte with Addressing sint, sint, sint*/
		iprintld("ADDAH {+baseR[offsetR], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x38 && unit == DUNIT) {
		/*ADDAW Add Byte with Addressing sint, sint, sint*/
		iprintld("ADDAW {+baseR[offsetR], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x32 && unit == DUNIT) {
		/*ADDAB Add Byte with Addressing ucsut5, sint, sint*/
		iprintldc("ADDAB {+baseR[offset], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x36 && unit == DUNIT) {
		/*ADDAH Add Byte with Addressing ucsut5, sint, sint*/
		iprintldc("ADDAH {+baseR[offset], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x3a && unit == DUNIT) {
		/*ADDAW Add Byte with Addressing ucsut5, sint, sint*/
		iprintldc("ADDAW {+baseR[offset], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0 && unit == SUNIT_ADDK) {
		/*ADDK cst16, usint*/
		iprint2c("ADDK {cst16, usint}", ((inst >> 7 &0x0000ffff) << 16) >> 16,
				dst, "S", s, x, 0);

	} else if (op == 0x01 && unit == SUNIT) {
		/*ADD2 sint, xsint, sint*/
		iprint("ADD2 {sint, xsint, sint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x7b && unit == LUNIT) {
		/*AND usint, xusint, usint*/
		iprint("AND {usint, xusint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x1f && unit == SUNIT) {
		/*AND usint, xusint, usint*/
		iprint("AND {usint, xusint, usint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x7a && unit == LUNIT) {
		/*AND scst5, xusint, usint*/
		iprintc1("AND {scst5, xusint, usint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x1e && unit == SUNIT) {
		/*AND scst5, xusint, usint*/
		iprintc1("AND {scst5, xusint, usint}", sicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x00 && unit == SUNIT_BCOND) {
		/*Branch Using a Displacement*/
		iprint1c("B {scst21}", (((inst >> 7) & 0x001fffff) << 11) >> 11, "S",
				s, x, 0);

	} else if (op == 0x0d && unit == SUNIT) {
		/*Branch using a Register*/
		iprint1("B {xusint}", src2, "S", s, x, 2);

	} else if (op == 0x03 && unit == SUNIT &&src2 == 0x06) {
		/*Branch Using an IRP - Interrupt Return Pointer*/
		iprint0("B IRP ");

	} else if (op == 0x03 && unit == SUNIT && src2 == 0x07) {
		/*Branch using NMI Return Pointer & set NMIE in crf[IER]*/
		iprint0("B NRP ");

	} else if (op == 0x03 && unit == SUNIT_IMMED) {
		/*CLR Clear Bit Fields of src2 whose bounds are given by csta & cstb*/
		/*ucst5, ucst5, usint, usint*/
		iprint4("CLR {ucst5, ucst5, usint, usint}", ((inst >> 13) & 0x1f),
				((inst >> 8) & 0x1f), src2, dst, "S", s, x, 0);

	} else if (op == 0x3f && unit == SUNIT) {
		/*CLR Clear Bit Fields of src2 whose bounds are given by 5-9 & 0-4 of src1*/
		/*usint, xusint, usint*/
		iprint("CLR {usint, xusint, usint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x53 && unit == LUNIT) {
		/*CMPEQ sint, xsint, usint*/
		iprint("CMPEQ {sint, xsint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x52 && unit == LUNIT) {
		/*CMPEQ scst5, xsint, usint*/
		iprintc1("CMPEQ {scst5, xsint, usint}", sicst1, src2, dst, "L", s, x, 2);

