TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
	} else if (op == 0x51 && unit == LUNIT) {
		/*CMPEQ xsint, slong, usint*/
		iprint("CMPEQ {xsint, slong, usint}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x50 && unit == LUNIT) {
		/*CMPEQ scst5, slong, usint*/
		iprintc1("CMPEQ {scst5, slong, usint}", sicst1, src2, dst, "L", s, x, 0);

	} else if (op == 0x47 && unit == LUNIT) {
		/*CMPGT sint, xsint, usint*/
		iprint("CMPGT {sint, xsint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x46 && unit == LUNIT) {
		/*CMPGT scst5, xsint, usint*/
		iprintc1("CMPGT {scst5, xsint, usint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x45 && unit == LUNIT) {
		/*CMPGT xsint, slong, usint*/
		iprint("CMPGT {xsint, slong, usint}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x44 && unit == LUNIT) {
		/*CMPGT scst5, slong, usint*/
		iprintc1("CMPGT {scst5, slong, usint}", sicst1, src2, dst, "L", s, x, 0);

	} else if (op == 0x4f && unit == LUNIT) {
		/*CMPGTU usint, xusint, usint*/
		iprint("CMPGTU {usint, xusint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x4e && unit == LUNIT) {
		/*CMPGTU ucst5, xusint, usint*/
		iprintc1("CMPGTU {ucst5, xusint, usint}", uicst1, src2, dst, "L", s, x,
				2);

	} else if (op == 0x4d && unit == LUNIT) {
		/*CMPGTU xusint, uslong, usint*/
		iprint("CMPGTU {xusint, uslong, usint}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x4c && unit == LUNIT) {
		/*CMPGTU ucst5, uslong, usint*/
		iprintc1("CMPGTU {ucst5, uslong, usint}", uicst1, src2, dst, "L", s, x,
				0);

	} else if (op == 0x57 && unit == LUNIT) {
		/*CMPLT sint, xsint, usint*/
		iprint("CMPLT {sint, xsint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x56 && unit == LUNIT) {
		/*CMPLT scst5, xsint, usint*/
		iprintc1("CMPLT {scst5, xsint, usint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x55 && unit == LUNIT) {
		/*CMPLT xsint, slong, usint*/
		iprint("CMPLT {xsint, slong, usint}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x54 && unit == LUNIT) {
		/*CMPLT scst5, slong, usint*/
		iprintc1("CMPLT {scst5, slong, usint}", sicst1, src2, dst, "L", s, x, 0);

	} else if (op == 0x5f && unit == LUNIT) {
		/*CMPLTU usint, xusint, usint*/
		iprint("CMPLTU {usint, xusint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x5e && unit == LUNIT) {
		/*CMPLTU ucst5, xusint, usint*/
		iprintc1("CMPLTU {ucst5, xusint, usint}", uicst1, src2, dst, "L", s, x,
				2);

	} else if (op == 0x5d && unit == LUNIT) {
		/*CMPLTU xusint, uslong, usint*/
		iprint("CMPLTU {xusint, uslong, usint}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x5c && unit == LUNIT) {
		/*CMPLTU ucst5, uslong, usint*/
		iprintc1("CMPLTU {ucst5, uslong, usint}", uicst1, src2, dst, "L", s, x,
				0);

	} else if (op == 0x01 && unit == SUNIT_IMMED) {
		/*EXT Extract & Sign Extend a bit field*/
		/*ucst5, ucst5, sint, sint*/
		iprint4("EXT {ucst5, ucst5, sint, sint}", ((inst >> 13) & 0x1f), ((inst
				>> 8) & 0x1f), src2, dst, "S", s, x, 0);

	} else if (op == 0x2f && unit == SUNIT) {
		/*EXT Extract & Sign Extend a bit field*/
		/*usint, xsint, sint*/
		iprint("EXT {usint, xsint, sint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x00 && unit == SUNIT_IMMED) {
		/*EXTU Extract & Zero Extend a bit field*/
		/*ucst5, ucst5, usint, usint*/
		iprint4("EXT {ucst5, ucst5, usint, usint}", ((inst >> 13) & 0x1f),
				((inst >> 8) & 0x1f), src2, dst, "S", s, x, 0);

	} else if (op == 0x2b && unit == SUNIT) {
		/*EXTU Extract & Zero Extend a bit field*/
		/*usint, xusint, usint*/
		iprint("EXT {usint, xusint, usint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x78 && unit == IDLEUNIT) {
		//**** TODO "IDLE"
		iprint0("IDLE");

	} else if (op == 0x02 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDB Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		switch (mode) {
		case 0x5:
			iprintld("LDB {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x4:
			iprintld("LDB {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xd:
			iprintld("LDB {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xc:
			iprintld("LDB {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xf:
			iprintld("LDB {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xe:
			iprintld("LDB {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x1:
			iprintldc("LDB {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x0:
			iprintldc("LDB {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x9:
			iprintldc("LDB {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x8:
			iprintldc("LDB {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xb:
			iprintldc("LDB {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xa:
			iprintldc("LDB {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		default:
			iprintld("LDB **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;

		}

	} else if (op == 0x01 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDBU Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		switch (mode) {
		case 0x5:
			iprintld("LDBU {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x4:
			iprintld("LDBU {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xd:
			iprintld("LDBU {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xc:
			iprintld("LDBU {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xf:
			iprintld("LDBU {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xe:
			iprintld("LDBU {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x1:
			iprintldc("LDBU {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x0:
			iprintldc("LDBU {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x9:
			iprintldc("LDBU {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x8:
			iprintldc("LDBU {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xb:
			iprintldc("LDBU {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;

