TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
		case 0xa:
			iprintldc("LDBU {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		default:
			iprintld("LDBU **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;

		}

	} else if (op == 0x04 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDH Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		switch (mode) {
		case 0x5:
			iprintld("LDH {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x4:
			iprintld("LDH {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xd:
			iprintld("LDH {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xc:
			iprintld("LDH {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xf:
			iprintld("LDH {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xe:
			iprintld("LDH {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x1:
			iprintldc("LDH {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x0:
			iprintldc("LDH {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x9:
			iprintldc("LDH {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x8:
			iprintldc("LDH {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xb:
			iprintldc("LDH {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xa:
			iprintldc("LDH {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		default:
			iprintld("LDH **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;

		}

	} else if (op == 0x00 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDHU Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		switch (mode) {
		case 0x5:
			iprintld("LDHU {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x4:
			iprintld("LDHU {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xd:
			iprintld("LDHU {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xc:
			iprintld("LDHU {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xf:
			iprintld("LDHU {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xe:
			iprintld("LDHU {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x1:
			iprintldc("LDHU {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x0:
			iprintldc("LDHU {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x9:
			iprintldc("LDHU {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x8:
			iprintldc("LDHU {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xb:
			iprintldc("LDHU {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xa:
			iprintldc("LDHU {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		default:
			iprintld("LDHU **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;

		}

	} else if (op == 0x06 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDW Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		switch (mode) {
		case 0x5:
			iprintld("LDW {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x4:
			iprintld("LDW {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xd:
			iprintld("LDW {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xc:
			iprintld("LDW {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xf:
			iprintld("LDW {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xe:
			iprintld("LDW {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x1:
			iprintldc("LDW {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x0:
			iprintldc("LDW {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x9:
			iprintldc("LDW {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0x8:
			iprintldc("LDW {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xb:
			iprintldc("LDW {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		case 0xa:
			iprintldc("LDW {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;

		default:
			iprintld("LDW **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;

		}

	} else if (op == 0x02 && unit == DUNIT_LDSTOFFSET) {
		/*LDB Load Byte ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		iprintldc("LDB {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x01 && unit == DUNIT_LDSTOFFSET) {
		/*LDBU Load Byte ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 0;
		iprintldc("LDBU {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x04 && unit == DUNIT_LDSTOFFSET) {
		/*LDH Load HlafByte ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 1;
		iprintldc("LDH {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x00 && unit == DUNIT_LDSTOFFSET) {
		/*LDHU Load HalfByte ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 1;
		iprintldc("LDHU {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x06 && unit == DUNIT_LDSTOFFSET) {
		/*LDW Load Word ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 2;
		iprintldc("LDW {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x6b && unit == LUNIT) {
		/*LMBD - Left Most Bit Detection usint, xusint, usint*/
		iprint("LMBD {usint, xusint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x6a && unit == LUNIT) {
		/*LMBD - Left Most Bit Detection ucst5, xusint, usint*/
		iprintc1("LMBD {ucst5, xusint, usint}", uicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x19 && unit == MUNIT) {
		/*MPY Integer Multiply 16lsb x 16lsb slsb16, xslsb16, sint*/
		iprint("MPY {slsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x1f && unit == MUNIT) {
		/*MPYU Integer Multiply 16lsb x 16lsb ulsb16, xulsb16, usint*/
		iprint("MPYU {ulsb16, xulsb16, usint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x1d && unit == MUNIT) {
		/*MPYUS Integer Multiply 16lsb x 16lsb ulsb16, xslsb16, sint*/
		iprint("MPYUS {ulsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

