TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
	} else if (op == 0x1b && unit == MUNIT) {
		/*MPYSU Integer Multiply 16lsb x 16lsb slsb16, xulsb16, sint*/
		iprint("MPYSU {slsb16, xulsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x18 && unit == MUNIT) {
		/*MPY Integer Multiply 16lsb x 16lsb scst5, xslsb16, sint*/
		iprintc1("MPY {scst5, xslsb16, sint}", sicst1, src2, dst, "M", s, x, 2);

	} else if (op == 0x1e && unit == MUNIT) {
		/*MPYSU Integer Multiply 16lsb x 16lsb scst5, xulsb16, sint*/
		iprintc1("MPYSU {scst5, xulsb16, sint}", sicst1, src2, dst, "M", s, x,
				2);

	} else if (op == 0x01 && unit == MUNIT) {
		/*MPYH Integer Multiply 16msb x 16msb smsb16, xsmsb16, sint*/
		iprint("MPYH {smsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x07 && unit == MUNIT) {
		/*MPYHU Integer Multiply 16msb x 16msb umsb16, xumsb16, usint*/
		iprint("MPYHU {umsb16, xumsb16, usint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x05 && unit == MUNIT) {
		/*MPYHUS Integer Multiply 16msb x 16msb umsb16, xsmsb16, sint*/
		iprint("MPYHUS {umsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x03 && unit == MUNIT) {
		/*MPYHSU Integer Multiply 16msb x 16msb smsb16, xumsb16, sint*/
		iprint("MPYHSU {smsb16, xumsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x09 && unit == MUNIT) {
		/*MPYHL Integer Multiply 16msb x 16lsb smsb16, xslsb16, sint*/
		iprint("MPYHL {smsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0f && unit == MUNIT) {
		/*MPYHLU Integer Multiply 16msb x 16lsb umsb16, xulsb16, usint*/
		iprint("MPYHLU {umsb16, xulsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0d && unit == MUNIT) {
		/*MPYHULS Integer Multiply 16msb x 16lsb umsb16, xslsb16, sint*/
		iprint("MPYHULS {umsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0b && unit == MUNIT) {
		/*MPYHSLU Integer Multiply 16msb x 16lsb smsb16, xulsb16, sint*/
		iprint("MPYHSLU {smsb16, xulsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x11 && unit == MUNIT) {
		/*MPYLH Integer Multiply 16lsb x 16msb slsb16, xsmsb16, sint*/
		iprint("MPYLH {slsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x17 && unit == MUNIT) {
		/*MPYLHU Integer Multiply 16lsb x 16msb ulsb16, xumsb16, usint*/
		iprint("MPYLHU {ulsb16, xumsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x15 && unit == MUNIT) {
		/*MPYLUHS Integer Multiply 16lsb x 16msb ulsb16, xsmsb16, sint*/
		iprint("MPYLUHS {ulsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x11 && unit == MUNIT) {
		/*MPYLSHU Integer Multiply 16lsb x 16msb slsb16, xumsb16, sint*/
		iprint("MPYLSHU {slsb16, xumsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0f && unit == SUNIT) {
		/*MVC Move between Control File & Register File usint, usint*/
		iprint2("MVC {usint, usint}", src2, dst, "S", s, x, 0);

	} else if (op == 0x0e && unit == SUNIT) {
		/*MVC Move between Control File & Register File xusint, usint*/
		iprint2("MVC {xusint, usint}", src2, dst, "S", s, x, 2);

	} else if (op == 0x00 && unit == SUNIT_MVK && (inst >> 6 & 0x01) == 0x00) {
		/*MVK Move a 16bit signed constant into a Register & Sign Extend scst16, sint*/
		iprint2c("MVK {scst16, sint}", ((inst >> 7 & 0x0000ffff) << 16) >>16,
				dst, "S", s, x, 0);

	} else if (op == 0x00 && unit == SUNIT_MVK && (inst >> 6 & 0x01) == 0x01) {
		/*MVKH Move 16bit constant into the Upper Bits of a Register uscst16, sint*/
		iprint2c("MVKH {uscst16, sint}", (((inst >> 7) & 0x0000ffff) << 16),
				dst, "S", s, x, 0);

	} else if (op == 0x00 && unit == 0x00) {
		iprint01("NOP", ((inst >> 13) & 0x000f) + 1);

	} else if (op == 0x63 && unit == LUNIT) {
		/*NORM Normalize Integer, # of redundant sign bits are found xsint, usint*/
		iprint2("NORM {xsint, usint}", src2, dst, "L", s, x, 2);

	} else if (op == 0x60 && unit == LUNIT) {
		/*NORM Normalize Integer, # of redundant sign bits are found slong, usint*/
		iprint2("NORM {slong, usint}", src2, dst, "L", s, x, 0);

	} else if (op == 0x7f && unit == LUNIT) {
		/*Bitwise OR usint, xusint, usint*/
		iprint("OR {usint, xusint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x1b && unit == SUNIT) {
		/*Bitwise OR usint, xusint, usint*/
		iprint("OR {usint, xusint, usint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x7e && unit == LUNIT) {
		/*Bitwise OR scst5, xusint, usint*/
		iprintc1("OR {scst5, xusint, usint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x1a && unit == SUNIT) {
		/*Bitwise OR scst5, xusint, usint*/
		iprintc1("OR {scst5, xusint, usint}", sicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x13 && unit == LUNIT) {
		/*SADD Integer addition with saturation to result size sint, xsint, sint*/
		iprint("SADD {sint, xsint, sint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x31 && unit == LUNIT) {
		/*SADD Integer addition with saturation to result size xsint, slong, slong*/
		iprint("SADD {xsint, slong, slong}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x12 && unit == LUNIT) {
		/*SADD Integer addition with saturation to result size scst5, xsint, sint*/
		iprintc1("SADD {scst5, xsint, sint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x30 && unit == LUNIT) {
		/*SADD Integer addition with saturation to result size scst5, slong, slong*/
		iprintc1("SADD {scst5, slong, slong}", sicst1, src2, dst, "L", s, x, 0);

	} else if (op == 0x40 && unit == LUNIT && src1 == 0x00) {
		/*SAT saturate a 40bit integer to a 32bit integer slong, sint*/
		iprint2("SAT {slong, sint}", src2, dst, "L", s, x, 0);

	} else if (op == 0x02 && unit == SUNIT_IMMED) {
		/*SET Set Bit Fields of src2 whose bounds are given by csta & cstb*/
		/*ucst5, ucst, usint, usint*/
		iprint4("SET {ucst5, ucst5, usint, usint}", ((inst >> 13) & 0x1f),
				((inst >> 8) & 0x1f), src2, dst, "S", s, x, 0);

	} else if (op == 0x3b && unit == SUNIT) {
		/*SET Set Bit Fields of src2 whose bounds are given by 5-9 & 0-4 of src1*/
		/*usint, xusint, usint*/
		iprint("SET {usint, xusint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x33 && unit == SUNIT) {
		/*SHL Shift Left by amount given in src1 usint, xsint, sint*/
		iprint("SHL {usint, xsint, sint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x31 && unit == SUNIT) {
		/*SHL Shift Left by amount given in src1 usint, slong, slong*/
		iprint("SHL {usint, slong, slong}", src1, src2, dst, "S", s, x, 0);

	} else if (op == 0x13 && unit == SUNIT) {
		/*SHL Shift Left by amount given in src1 usint, xusint, uslong*/
		iprint("SHL {usint, xusint, uslong}", src1, src2, dst, "S", s, x, 2);

