TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
	} else if (op == 0x32 && unit == SUNIT) {
		/*SHL Shift Left by amount given in src1 ucst5, xsint, sint*/
		iprintc1("SHL {ucst5, xsint, sint}", uicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x30 && unit == SUNIT) {
		/*SHL Shift Left by amount given in src1 ucst5, slong, slong*/
		iprintc1("SHL {ucst5, slong, slong}", uicst1, src2, dst, "S", s, x, 0);

	} else if (op == 0x12 && unit == SUNIT) {
		/*SHL Shift Left by amount given in src1 ucst5, xusint, uslong*/
		iprintc1("SHL {ucst5, xusint, uslong}", uicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x37 && unit == SUNIT) {
		/*SHR Shift Right  by amount given in src1 usint, xsint, sint*/
		iprint("SHR {usint, xsint, sint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x35 && unit == SUNIT) {
		/*SHR Shift Right by amount given in src1 usint, slong, slong*/
		iprint("SHR {usint, slong, slong}", src1, src2, dst, "S", s, x, 0);

	} else if (op == 0x36 && unit == SUNIT) {
		/*SHR Shift Right by amount given in src1 ucst5, xsint, sint*/
		iprintc1("SHR {ucst5, xsint, sint}", uicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x34 && unit == SUNIT) {
		/*SHR Shift Right by amount given in src1 ucst5, slong, slong*/
		iprintc1("SHR {ucst5, slong, slong}", uicst1, src2, dst, "S", s, x, 0);

	} else if (op == 0x27 && unit == SUNIT) {
		/*SHRU Logical Shift Right by amount given in src1 usint, xusint, usint*/
		iprint("SHRU {usint, xusint, usint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x25 && unit == SUNIT) {
		/*SHRU Logical Shift Right by amount given in src1 usint, uslong, uslong*/
		iprint("SHRU {usint, uslong, uslong}", src1, src2, dst, "S", s, x, 0);

	} else if (op == 0x26 && unit == SUNIT) {
		/*SHRU Logical Shift Right by amount given in src1 ucst5, xusint, usint*/
		iprintc1("SHRU {ucst5, xusint, usint}", uicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x24 && unit == SUNIT) {
		/*SHRU Logical Shift Right by amount given in src1 ucst5, uslong, uslong*/
		iprintc1("SHRU {ucst5, uslong, uslong}", uicst1, src2, dst, "S", s, x,
				0);

	} else if (op == 0x1a && unit == MUNIT) {
		/*SMPY slsb16, xslsb16, sint*/
		iprint("SMPY {slsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0a && unit == MUNIT) {
		/*SMPYHL smsb16, xslsb16, sint*/
		iprint("SMPYHL {smsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x12 && unit == MUNIT) {
		/*SMPYLH slsb16, xsmsb16, sint*/
		iprint("SMPYLH {slsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x02 && unit == MUNIT) {
		/*SMPYH smsb16, xsmsb16, sint*/
		iprint("SMPYH {smsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x23 && unit == SUNIT) {
		/*SSHL Shift Left with Saturation usint, xsint, sint*/
		iprint("SSHL {usint, xsint, sint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x22 && unit == SUNIT) {
		/*SSHL Shift Left with Saturation ucst5, xsint, sint*/
		iprintc1("SSHL {ucst5, xsint, sint}", uicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x0f && unit == LUNIT) {
		/*SSUB Integer addition with saturation to result size sint, xsint, sint*/
		iprint("SSUB {sint, xsint, sint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x1f && unit == LUNIT) {
		/*SSUB Integer addition with saturation to result size xsint, sint, sint*/
		iprint("SSUB {xsint, sint, sint}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x0e && unit == LUNIT) {
		/*SSUB Integer addition with saturation to result size scst5, xsint, sint*/
		iprintc1("SSUB {scst5, xsint, sint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x2c && unit == LUNIT) {
		/*SSUB Integer addition with saturation to result size scst5, slong, slong*/
		iprintc1("SSUB {scst5, slong, slong}", sicst1, src2, dst, "L", s, x, 0);

	} else if (op == 0x03 && unit == DUNIT_LDSTBASEROFFSET) {
		/*STB Store Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		switch (mode) {
		case 0x5:
			iprintst("STB {src, +baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0x4:
			iprintst("STB {src, -baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xd:
			iprintst("STB {src, ++baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xc:
			iprintst("STB {src, --baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xf:
			iprintst("STB {src, baseR++[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xe:
			iprintst("STB {src, baseR--[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0x1:
			iprintstc("STB {src, +baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0x0:
			iprintstc("STB {src, -baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0x9:
			iprintstc("STB {src, ++baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0x8:
			iprintstc("STB {src, --baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0xb:
			iprintstc("STB {src, baseR++[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0xa:
			iprintstc("STB {src, baseR--[offset]}", src1, src2, dst, "D", s, y);
			break;

		default:
			iprintst("STB **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;

		}

	} else if (op == 0x05 && unit == DUNIT_LDSTBASEROFFSET) {
		/*STH Store Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		switch (mode) {
		case 0x5:
			iprintst("STH {src, +baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0x4:
			iprintst("STH {src, -baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xd:
			iprintst("STH {src, ++baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xc:
			iprintst("STH {src, --baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xf:
			iprintst("STH {src, baseR++[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xe:
			iprintst("STH {src, baseR--[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0x1:
			iprintstc("STH {src, +baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0x0:
			iprintstc("STH {src, -baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

