TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
		case 0x9:
			iprintstc("STH {src, ++baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0x8:
			iprintstc("STH {src, --baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0xb:
			iprintstc("STH {src, baseR++[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0xa:
			iprintstc("STH {src, baseR--[offset]}", src1, src2, dst, "D", s, y);
			break;

		default:
			iprintst("STH **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;

		}

	} else if (op == 0x07 && unit == DUNIT_LDSTBASEROFFSET) {
		/*STW Store Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		switch (mode) {
		case 0x5:
			iprintst("STW {src, +baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0x4:
			iprintst("STW {src, -baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xd:
			iprintst("STW {src, ++baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xc:
			iprintst("STW {src, --baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xf:
			iprintst("STW {src, baseR++[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0xe:
			iprintst("STW {src, baseR--[offsetR]}", src1, src2, dst, "D", s, y);
			break;

		case 0x1:
			iprintstc("STW {src, +baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0x0:
			iprintstc("STW {src, -baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0x9:
			iprintstc("STW {src, ++baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0x8:
			iprintstc("STW {src, --baseR[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0xb:
			iprintstc("STW {src, baseR++[offset]}", src1, src2, dst, "D", s, y);
			break;

		case 0xa:
			iprintstc("STW {src, baseR--[offset]}", src1, src2, dst, "D", s, y);
			break;

		default:
			iprintst("STW **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;

		}

	} else if (op == 0x03 && unit == DUNIT_LDSTOFFSET) {
		/*STB Store Byte*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 0;
		iprintstc("STB {src, +baseR[offset]}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x05 && unit == DUNIT_LDSTOFFSET) {
		/*STH Store Halfword*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 1;
		iprintstc("STH {src, +baseR[offset]}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x07 && unit == DUNIT_LDSTOFFSET) {
		/*STW Store Word*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 2;
		iprintstc("STW {src, +baseR[offset]}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x07 && unit == LUNIT) {
		/*SUB without saturation sint, xsint, sint*/
		iprint("SUB {sint, xsint, sint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x17 && unit == SUNIT) {
		/*SUB without saturation sint, xsint, sint*/
		iprint("SUB {sint, xsint, sint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x17 && unit == LUNIT) {
		/*SUB without saturation xsint, sint, sint*/
		iprint("SUB {xsint, sint, sint}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x27 && unit == LUNIT) {
		/*SUB without saturation sint, xsint, slong*/
		iprint("SUB {sint, xsint, slong}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x37 && unit == LUNIT) {
		/*SUB without saturation xsint, sint, slong*/
		iprint("SUB {xsint, sint, slong}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x2f && unit == LUNIT) {
		/*SUBU without saturation usint, xusint, uslong*/
		iprint("SUB {usint, xusint, uslong}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x3f && unit == LUNIT) {
		/*SUBU without saturation xusint, usint, uslong*/
		iprint("SUB {xusint, usint, uslong}", src1, src2, dst, "L", s, x, 1);

	} else if (op == 0x06 && unit == LUNIT) {
		/*SUB without saturation scst5, xsint, sint*/
		iprintc1("SUB {scst5, xsint, sint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x16 && unit == SUNIT) {
		/*SUB without saturation scst5, xsint, sint*/
		iprintc1("SUB {scst5, xsint, sint}", sicst1, src2, dst, "S", s, x, 2);

	} else if (op == 0x24 && unit == LUNIT) {
		/*SUB without saturation scst5, slong, slong*/
		iprintc1("SUB {scst5, slong, slong}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x11 && unit == DUNIT) {
		/*SUB without saturation sint, sint, sint*/
		iprint("SUB {sint, sint, sint}", src1, src2, dst, "D", s, x, 0);

	} else if (op == 0x13 && unit == DUNIT) {
		/*SUB without saturation ucst5, sint, sint*/
		iprintc1("SUB {ucst5, sint, sint}", uicst1, src2, dst, "D", s, x, 0);

	} else if (op == 0x31 && unit == DUNIT) {
		/*SUBAB Add Byte with Addressing sint, sint, sint*/
		iprintld("SUBAB {+baseR[offsetR], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x35 && unit == DUNIT) {
		/*SUBAH Add Byte with Addressing sint, sint, sint*/
		iprintld("SUBAH {+baseR[offsetR], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x39 && unit == DUNIT) {
		/*SUBAW Add Byte with Addressing sint, sint, sint*/
		iprintld("SUBAW {+baseR[offsetR], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x33 && unit == DUNIT) {
		/*SUBAB Add Byte with Addressing ucsut5, sint, sint*/
		iprintldc("SUBAB {+baseR[offset], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x37 && unit == DUNIT) {
		/*SUBAH Add Byte with Addressing ucsut5, sint, sint*/
		iprintldc("SUBAH {+baseR[offset], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x3b && unit == DUNIT) {
		/*SUBAW Add Byte with Addressing ucsut5, sint, sint*/
		iprintldc("SUBAW {+baseR[offset], dst}", src1, src2, dst, "D", s, x);

	} else if (op == 0x4b && unit == LUNIT) {
		/*SUBC Conditional Integer Subtract and Shift - used for division usint, xusint, usint*/
		iprint("SUBC {usint, xusint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x11 && unit == SUNIT) {
		/*SUB2 Subtractions of lower and upper halfs sint, xsint, sint*/
		iprint("SUB2 {sint, xsint, sint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x6f && unit == LUNIT) {
		/*XOR usint, xusint, usint*/
		iprint("XOR {usint, xusint, usint}", src1, src2, dst, "L", s, x, 2);

	} else if (op == 0x0b && unit == SUNIT) {
		/*XOR usint, xusint, usint*/
		iprint("XOR {usint, xusint, usint}", src1, src2, dst, "S", s, x, 2);

	} else if (op == 0x6e && unit == LUNIT) {
		/*XOR scst5, xusint, usint*/
		iprintc1("XOR {scst5, xusint, usint}", sicst1, src2, dst, "L", s, x, 2);

	} else if (op == 0x0a && unit == SUNIT) {
		/*XOR scst5, xusint, usint*/
		iprintc1("XOR {scst5, xusint, usint}", sicst1, src2, dst, "S", s, x, 2);

	} else {
		iprint0("***UNIDENTIFIED INSTRUCTION***\n");

