TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
	}
}

void Tms320C6xIss::instruction_print_mpy(uint32_t inst) {
	/*instruction print
	 *decode instructions, source & destination registers
	 *and print them out
	 */

	char creg, z, op = 0, unit = 0;
	char dst, src1, src2, x, s;
	uint32_t uicst1;
	int32_t sicst1;
	int64_t slcst1;
	uint64_t ulcst1;

	creg = (inst >> 29) & 0x07;
	z = (inst >> 28) & 0x01;
	dst = (inst >> 23) & 0x1f;
	src2 = (inst >> 18) & 0x1f;
	src1 = (inst >> 13) & 0x1f;
	x = 0;
	s = (inst >> 1) & 0x01;
	if (getUnit_3bit(inst) == LUNIT) {
		/*.L unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 5) & 0x7f;
		unit = LUNIT;

	} else if (getUnit_5bit(inst) == MUNIT) {
		/*.M unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 7) & 0x1f;
		unit = MUNIT;

	} else if (getUnit_5bit(inst) == DUNIT) {
		/*.D unit instruction*/
		op = (inst >> 7) & 0x3f;
		unit = DUNIT;

	} else if (getUnit_2bit(inst) == DUNIT_LDSTOFFSET) {
		/*.D unit load/store*/
		op = (inst >> 4) & 0x07;
		unit = DUNIT_LDSTOFFSET;

	} else if (getUnit_2bit(inst) == DUNIT_LDSTBASEROFFSET) {
		/*.D unit load/store with baseR/offsetR specified*/
		op = (inst >> 4) & 0x07;
		unit = DUNIT_LDSTBASEROFFSET;

	} else if (getUnit_4bit(inst) == SUNIT) {
		/*.S unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 6) & 0x3f;
		unit = SUNIT;

	} else if (getUnit_5bit(inst) == SUNIT_ADDK) {
		/*.S unit ADDK instruction*/
		op = 0; /*nothing specified*/
		unit = SUNIT_ADDK;

	} else if (getUnit_4bit(inst) == SUNIT_IMMED) {
		/*.S unit Field operations (immediate forms)*/
		op = (inst >> 6) & 0x03;
		unit = SUNIT_IMMED;

	} else if (getUnit_4bit(inst) == SUNIT_MVK) {
		/*.S unit MVK*/
		op = 0; /*nothing specified*/
		unit = SUNIT_MVK;

	} else if (getUnit_5bit(inst) == SUNIT_BCOND) {
		/*.S unit Bcond disp*/
		op = 0; /*nothing specified*/
		unit = SUNIT_BCOND;

	} else if (getUnit_11bit(inst) == NOP) {
		/*NOP instruction*/
		op = 0;
		unit = 0;

	} else if (getUnit_16bit(inst) == IDLEINST) {
		op = IDLEOP;
		unit = IDLEUNIT;
	} else {
		/* unknown instruction kind */
		std::cout
				<< "unknown instruction type  encountered in instruction_print_mpy function "
				<< std::endl;
	}

	/*find constants*/
	sicst1 = ((int32_t) src1 << 27) >> 27; /*taking care of sign bit extn*/
	uicst1 = (uint32_t) src1;
	slcst1 = ((int64_t) src1 << 59) >> 59; /*taking care of sign bit extn*/
	ulcst1 = (uint64_t) src1;

	if (op == 0x19 && unit == MUNIT) {
		/*MPY Integer Multiply 16lsb x 16lsb slsb16, xslsb16, sint*/
		print_creg(inst);
		iprint("MPY {slsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x1f && unit == MUNIT) {
		/*MPYU Integer Multiply 16lsb x 16lsb ulsb16, xulsb16, usint*/
		print_creg(inst);
		iprint("MPYU {ulsb16, xulsb16, usint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x1d && unit == MUNIT) {
		/*MPYUS Integer Multiply 16lsb x 16lsb ulsb16, xslsb16, sint*/
		print_creg(inst);
		iprint("MPYUS {ulsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x1b && unit == MUNIT) {
		/*MPYSU Integer Multiply 16lsb x 16lsb slsb16, xulsb16, sint*/
		print_creg(inst);
		iprint("MPYSU {slsb16, xulsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x18 && unit == MUNIT) {
		/*MPY Integer Multiply 16lsb x 16lsb scst5, xslsb16, sint*/
		print_creg(inst);
		iprintc1("MPY {scst5, xslsb16, sint}", sicst1, src2, dst, "M", s, x, 2);

	} else if (op == 0x1e && unit == MUNIT) {
		/*MPYSU Integer Multiply 16lsb x 16lsb scst5, xulsb16, sint*/
		print_creg(inst);
		iprintc1("MPYSU {scst5, xulsb16, sint}", sicst1, src2, dst, "M", s, x,
				2);

	} else if (op == 0x01 && unit == MUNIT) {
		/*MPYH Integer Multiply 16msb x 16msb smsb16, xsmsb16, sint*/
		print_creg(inst);
		iprint("MPYH {smsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x07 && unit == MUNIT) {
		/*MPYHU Integer Multiply 16msb x 16msb umsb16, xumsb16, usint*/
		print_creg(inst);
		iprint("MPYHU {umsb16, xumsb16, usint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x05 && unit == MUNIT) {
		/*MPYHUS Integer Multiply 16msb x 16msb umsb16, xsmsb16, sint*/
		print_creg(inst);
		iprint("MPYHUS {umsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x03 && unit == MUNIT) {
		/*MPYHSU Integer Multiply 16msb x 16msb smsb16, xumsb16, sint*/
		print_creg(inst);
		iprint("MPYHSU {smsb16, xumsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x09 && unit == MUNIT) {
		/*MPYHL Integer Multiply 16msb x 16lsb smsb16, xslsb16, sint*/
		print_creg(inst);
		iprint("MPYHL {smsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0f && unit == MUNIT) {
		/*MPYHLU Integer Multiply 16msb x 16lsb umsb16, xulsb16, usint*/
		print_creg(inst);
		iprint("MPYHLU {umsb16, xulsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0d && unit == MUNIT) {
		/*MPYHULS Integer Multiply 16msb x 16lsb umsb16, xslsb16, sint*/
		print_creg(inst);
		iprint("MPYHULS {umsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0b && unit == MUNIT) {
		/*MPYHSLU Integer Multiply 16msb x 16lsb smsb16, xulsb16, sint*/
		print_creg(inst);
		iprint("MPYHSLU {smsb16, xulsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x11 && unit == MUNIT) {
		/*MPYLH Integer Multiply 16lsb x 16msb slsb16, xsmsb16, sint*/
		print_creg(inst);
		iprint("MPYLH {slsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x17 && unit == MUNIT) {
		/*MPYLHU Integer Multiply 16lsb x 16msb ulsb16, xumsb16, usint*/
		print_creg(inst);
		iprint("MPYLHU {ulsb16, xumsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x15 && unit == MUNIT) {
		/*MPYLUHS Integer Multiply 16lsb x 16msb ulsb16, xsmsb16, sint*/
		print_creg(inst);
		iprint("MPYLUHS {ulsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x13 && unit == MUNIT) {
		/*MPYLSHU Integer Multiply 16lsb x 16msb slsb16, xumsb16, sint*/
		print_creg(inst);
		iprint("MPYLSHU {slsb16, xumsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x1a && unit == MUNIT) {
		/*SMPY slsb16, xslsb16, sint*/
		print_creg(inst);
		iprint("SMPY {slsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x0a && unit == MUNIT) {
		/*SMPYHL smsb16, xslsb16, sint*/
		print_creg(inst);
		iprint("SMPYHL {smsb16, xslsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x12 && unit == MUNIT) {
		/*SMPYLH slsb16, xsmsb16, sint*/
		print_creg(inst);
		iprint("SMPYLH {slsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

	} else if (op == 0x02 && unit == MUNIT) {
		/*SMPYH smsb16, xsmsb16, sint*/
		print_creg(inst);
		iprint("SMPYH {smsb16, xsmsb16, sint}", src1, src2, dst, "M", s, x, 2);

