TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
	}
}

void Tms320C6xIss::instruction_print_ld(uint32_t inst) {
	/*instruction print
	 *decode instructions, source & destination registers
	 *and print them out
	 */

	char creg, z, op = 0, unit = 0;
	char dst, src1, src2, x, s;
	uint32_t uicst1, uitmp;
	int32_t sicst1;
	int64_t slcst1;
	uint64_t ulcst1;
	char y, mode;

	creg = (inst >> 29) & 0x07;
	z = (inst >> 28) & 0x01;
	dst = (inst >> 23) & 0x1f;
	src2 = (inst >> 18) & 0x1f;
	src1 = (inst >> 13) & 0x1f;
	x = 0;
	s = (inst >> 1) & 0x01;
	if (getUnit_3bit(inst) == LUNIT) {
		/*.L unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 5) & 0x7f;
		unit = LUNIT;

	} else if (getUnit_5bit(inst) == MUNIT) {
		/*.M unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 7) & 0x1f;
		unit = MUNIT;

	} else if (getUnit_5bit(inst) == DUNIT) {
		/*.D unit instruction*/
		op = (inst >> 7) & 0x3f;
		unit = DUNIT;

	} else if (getUnit_2bit(inst) == DUNIT_LDSTOFFSET) {
		/*.D unit load/store*/
		op = (inst >> 4) & 0x07;
		unit = DUNIT_LDSTOFFSET;

	} else if (getUnit_2bit(inst) == DUNIT_LDSTBASEROFFSET) {
		/*.D unit load/store with baseR/offsetR specified*/
		op = (inst >> 4) & 0x07;
		unit = DUNIT_LDSTBASEROFFSET;

	} else if (getUnit_4bit(inst) == SUNIT) {
		/*.S unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 6) & 0x3f;
		unit = SUNIT;

	} else if (getUnit_5bit(inst) == SUNIT_ADDK) {
		/*.S unit ADDK instruction*/
		op = 0; /*nothing specified*/
		unit = SUNIT_ADDK;

	} else if (getUnit_4bit(inst) == SUNIT_IMMED) {
		/*.S unit Field operations (immediate forms)*/
		op = (inst >> 6) & 0x03;
		unit = SUNIT_IMMED;

	} else if (getUnit_4bit(inst) == SUNIT_MVK) {
		/*.S unit MVK*/
		op = 0; /*nothing specified*/
		unit = SUNIT_MVK;

	} else if (getUnit_5bit(inst) == SUNIT_BCOND) {
		/*.S unit Bcond disp*/
		op = 0; /*nothing specified*/
		unit = SUNIT_BCOND;

	} else if (getUnit_11bit(inst) == NOP) {
		/*NOP instruction*/
		op = 0;
		unit = 0;

	} else if (getUnit_16bit(inst) == IDLEINST) {
		op = IDLEOP;
		unit = IDLEUNIT;
	} else {
		/* unknown instruction kind */
		std::cout
				<< "unknown instruction type encountered in instruction_print_ld function "
				<< std::endl;
	}

	/*find constants*/
	sicst1 = ((int32_t) src1 << 27) >> 27; /*taking care of sign bit extn*/
	uicst1 = (uint32_t) src1;
	slcst1 = ((int64_t) src1 << 59) >> 59; /*taking care of sign bit extn*/
	ulcst1 = (uint64_t) src1;

	if (op == 0x02 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDB Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		print_creg(inst);
		switch (mode) {
		case 0x5:
			iprintld("LDB {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x4:
			iprintld("LDB {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xd:
			iprintld("LDB {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xc:
			iprintld("LDB {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xf:
			iprintld("LDB {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xe:
			iprintld("LDB {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x1:
			iprintldc("LDB {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x0:
			iprintldc("LDB {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x9:
			iprintldc("LDB {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x8:
			iprintldc("LDB {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xb:
			iprintldc("LDB {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xa:
			iprintldc("LDB {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		default:
			iprintld("LDB **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;
		}

	} else if (op == 0x01 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDBU Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		print_creg(inst);
		switch (mode) {
		case 0x5:
			iprintld("LDBU {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x4:
			iprintld("LDBU {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xd:
			iprintld("LDBU {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xc:
			iprintld("LDBU {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xf:
			iprintld("LDBU {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xe:
			iprintld("LDBU {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x1:
			iprintldc("LDBU {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x0:
			iprintldc("LDBU {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x9:
			iprintldc("LDBU {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x8:
			iprintldc("LDBU {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xb:
			iprintldc("LDBU {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xa:
			iprintldc("LDBU {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		default:
			iprintld("LDBU **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;
		}

	} else if (op == 0x04 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDH Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		print_creg(inst);
		switch (mode) {
		case 0x5:
			iprintld("LDH {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x4:
			iprintld("LDH {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xd:
			iprintld("LDH {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xc:
			iprintld("LDH {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xf:
			iprintld("LDH {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xe:
			iprintld("LDH {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x1:
			iprintldc("LDH {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x0:
			iprintldc("LDH {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x9:
			iprintldc("LDH {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x8:
			iprintldc("LDH {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xb:
			iprintldc("LDH {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xa:
			iprintldc("LDH {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		default:
			iprintld("LDH **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;
		}

	} else if (op == 0x00 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDHU Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		print_creg(inst);
		switch (mode) {
		case 0x5:
			iprintld("LDHU {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x4:
			iprintld("LDHU {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xd:
			iprintld("LDHU {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xc:
			iprintld("LDHU {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xf:
			iprintld("LDHU {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xe:
			iprintld("LDHU {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x1:
			iprintldc("LDHU {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x0:
			iprintldc("LDHU {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x9:
			iprintldc("LDHU {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x8:
			iprintldc("LDHU {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xb:
			iprintldc("LDHU {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xa:
			iprintldc("LDHU {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		default:
			iprintld("LDHU **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;
		}

	} else if (op == 0x06 && unit == DUNIT_LDSTBASEROFFSET) {
		/*LDW Load Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		print_creg(inst);
		switch (mode) {
		case 0x5:
			iprintld("LDW {+baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x4:
			iprintld("LDW {-baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xd:
			iprintld("LDW {++baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xc:
			iprintld("LDW {--baseR[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xf:
			iprintld("LDW {baseR++[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xe:
			iprintld("LDW {baseR--[offsetR], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x1:
			iprintldc("LDW {+baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x0:
			iprintldc("LDW {-baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x9:
			iprintldc("LDW {++baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0x8:
			iprintldc("LDW {--baseR[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xb:
			iprintldc("LDW {baseR++[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		case 0xa:
			iprintldc("LDW {baseR--[offset], dst}", src1, src2, dst, "D", s, y);
			break;
		default:
			iprintld("LDW **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;
		}

