TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_decoding.cpp
	} else if (op == 0x02 && unit == DUNIT_LDSTOFFSET) {
		/*LDB Load Byte ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		print_creg(inst);
		iprintldc("LDB {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x01 && unit == DUNIT_LDSTOFFSET) {
		/*LDBU Load Byte ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 0;
		print_creg(inst);
		iprintldc("LDBU {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x04 && unit == DUNIT_LDSTOFFSET) {
		/*LDH Load HlafByte ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 1;
		print_creg(inst);
		iprintldc("LDH {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x00 && unit == DUNIT_LDSTOFFSET) {
		/*LDHU Load HalfByte ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 1;
		print_creg(inst);
		iprintldc("LDHU {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x06 && unit == DUNIT_LDSTOFFSET) {
		/*LDW Load Word ucst15, dst*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 2;
		print_creg(inst);
		iprintldc("LDW {+baseR[offset], dst}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	}

}

void Tms320C6xIss::instruction_print_st(uint32_t inst) {
	/*instruction print
	 *decode instructions, source & destination registers
	 *and print them out
	 */

	char creg, z, op = 0, unit = 0;
	char dst, src1, src2, x, s;
	uint32_t uicst1, uitmp;
	int32_t sicst1;
	int64_t slcst1;
	uint64_t ulcst1;
	char y, mode;

	creg = (inst >> 29) & 0x07;
	z = (inst >> 28) & 0x01;
	dst = (inst >> 23) & 0x1f;
	src2 = (inst >> 18) & 0x1f;
	src1 = (inst >> 13) & 0x1f;
	x = 0;
	s = (inst >> 1) & 0x01;
	if (getUnit_3bit(inst) == LUNIT) {
		/*.L unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 5) & 0x7f;
		unit = LUNIT;

	} else if (getUnit_5bit(inst) == MUNIT) {
		/*.M unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 7) & 0x1f;
		unit = MUNIT;

	} else if (getUnit_5bit(inst) == DUNIT) {
		/*.D unit instruction*/
		op = (inst >> 7) & 0x3f;
		unit = DUNIT;

	} else if (getUnit_2bit(inst) == DUNIT_LDSTOFFSET) {
		/*.D unit load/store*/
		op = (inst >> 4) & 0x07;
		unit = DUNIT_LDSTOFFSET;

	} else if (getUnit_2bit(inst) == DUNIT_LDSTBASEROFFSET) {
		/*.D unit load/store with baseR/offsetR specified*/
		op = (inst >> 4) & 0x07;
		unit = DUNIT_LDSTBASEROFFSET;

	} else if (getUnit_4bit(inst) == SUNIT) {
		/*.S unit instruction*/
		x = (inst >> 12) & 0x01;
		op = (inst >> 6) & 0x3f;
		unit = SUNIT;

	} else if (getUnit_5bit(inst) == SUNIT_ADDK) {
		/*.S unit ADDK instruction*/
		op = 0; /*nothing specified*/
		unit = SUNIT_ADDK;

	} else if (getUnit_4bit(inst) == SUNIT_IMMED) {
		/*.S unit Field operations (immediate forms)*/
		op = (inst >> 6) & 0x03;
		unit = SUNIT_IMMED;

	} else if (getUnit_4bit(inst) == SUNIT_MVK) {
		/*.S unit MVK*/
		op = 0; /*nothing specified*/
		unit = SUNIT_MVK;

	} else if (getUnit_5bit(inst) == SUNIT_BCOND) {
		/*.S unit Bcond disp*/
		op = 0; /*nothing specified*/
		unit = SUNIT_BCOND;

	} else if (getUnit_11bit(inst) == NOP) {
		/*NOP instruction*/
		op = 0;
		unit = 0;

	} else if (getUnit_16bit(inst) == IDLEINST) {
		op = IDLEOP;
		unit = IDLEUNIT;
	} else {
		/* unknown instruction kind */
		std::cout
				<< "unknown instruction type encountered in instruction_print_st function "
				<< std::endl;

	}

	/*find constants*/
	sicst1 = ((int32_t) src1 << 27) >> 27; /*taking care of sign bit extn*/
	uicst1 = (uint32_t) src1;
	slcst1 = ((int64_t) src1 << 59) >> 59; /*taking care of sign bit extn*/
	ulcst1 = (uint64_t) src1;

	if (op == 0x03 && unit == DUNIT_LDSTBASEROFFSET) {
		/*STB Store Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		print_creg(inst);
		switch (mode) {
		case 0x5:
			iprintst("STB {src, +baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0x4:
			iprintst("STB {src, -baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xd:
			iprintst("STB {src, ++baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xc:
			iprintst("STB {src, --baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xf:
			iprintst("STB {src, baseR++[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xe:
			iprintst("STB {src, baseR--[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0x1:
			iprintstc("STB {src, +baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x0:
			iprintstc("STB {src, -baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x9:
			iprintstc("STB {src, ++baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x8:
			iprintstc("STB {src, --baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0xb:
			iprintstc("STB {src, baseR++[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0xa:
			iprintstc("STB {src, baseR--[offset]}", src1, src2, dst, "D", s, y);
			break;
		default:
			iprintst("STB **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;
		}

	} else if (op == 0x05 && unit == DUNIT_LDSTBASEROFFSET) {
		/*STH Store Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		print_creg(inst);
		switch (mode) {
		case 0x5:
			iprintst("STH {src, +baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0x4:
			iprintst("STH {src, -baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xd:
			iprintst("STH {src, ++baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xc:
			iprintst("STH {src, --baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xf:
			iprintst("STH {src, baseR++[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xe:
			iprintst("STH {src, baseR--[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0x1:
			iprintstc("STH {src, +baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x0:
			iprintstc("STH {src, -baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x9:
			iprintstc("STH {src, ++baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x8:
			iprintstc("STH {src, --baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0xb:
			iprintstc("STH {src, baseR++[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0xa:
			iprintstc("STH {src, baseR--[offset]}", src1, src2, dst, "D", s, y);
			break;
		default:
			iprintst("STH **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;
		}

	} else if (op == 0x07 && unit == DUNIT_LDSTBASEROFFSET) {
		/*STW Store Byte*/
		y = inst >> 7 & 0x1;
		mode = inst >> 9 & 0xf;

		print_creg(inst);
		switch (mode) {
		case 0x5:
			iprintst("STW {src, +baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0x4:
			iprintst("STW {src, -baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xd:
			iprintst("STW {src, ++baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xc:
			iprintst("STW {src, --baseR[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xf:
			iprintst("STW {src, baseR++[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0xe:
			iprintst("STW {src, baseR--[offsetR]}", src1, src2, dst, "D", s, y);
			break;
		case 0x1:
			iprintstc("STW {src, +baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x0:
			iprintstc("STW {src, -baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x9:
			iprintstc("STW {src, ++baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0x8:
			iprintstc("STW {src, --baseR[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0xb:
			iprintstc("STW {src, baseR++[offset]}", src1, src2, dst, "D", s, y);
			break;
		case 0xa:
			iprintstc("STW {src, baseR--[offset]}", src1, src2, dst, "D", s, y);
			break;
		default:
			iprintst("STW **unknown mode**", 0, 0, 0, "D", 0, 0);
			break;
		}

	} else if (op == 0x03 && unit == DUNIT_LDSTOFFSET) {
		/*STB Store Byte*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 0;
		print_creg(inst);
		iprintstc("STB {src, +baseR[offset]}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x05 && unit == DUNIT_LDSTOFFSET) {
		/*STH Store Halfword*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 1;
		print_creg(inst);
		iprintstc("STH {src, +baseR[offset]}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	} else if (op == 0x07 && unit == DUNIT_LDSTOFFSET) {
		/*STW Store Word*/
		y = inst >> 7 & 0x1;
		uitmp = inst >> 8 & 0x7fff;
		uitmp = uitmp << 2;
		print_creg(inst);
		iprintstc("STW {src, +baseR[offset]}", uitmp, (y==0) ? 14 : 15, dst,
				"D", s, sideB);

	}

}

}
}

// Local Variables:
// tab-width: 4
// c-basic-offset: 4
// c-file-offsets:((innamespace . 0)(inline-open . 0))
// indent-tabs-mode: nil
// End:

// vim: filetype=cpp:expandtab:shiftwidth=4:tabstop=4:softtabstop=4
